# -*- coding: utf-8 -*-

# Дан список чисел. Определите,
# сколько в нем встречается различных чисел.

list_nums = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
set1 = set(list_nums)

print(list_nums)
print(len(list_nums))
